In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

# TOTAL PLAYERS

In [3]:
# Print total number of players
tot_players = purchase_data['SN'].nunique()

print('Total Players: ', tot_players)

Total Players:  576

# PURCHASING ANALYSIS (TOTAL)

In [4]:
# Print total number of unique items
unique_items = purchase_data['Item Name'].nunique()

print('Unique Items: ', unique_items)

Unique Items:  179

In [5]:
# Print average item price, format to include dollar sign and round to two decimals
avg_price = '${:.2f}'.format(purchase_data['Price'].mean())

print('Average Price per Item: ', avg_price)

Average Price per Item:  $3.05

In [6]:
# Print total purchases
tot_purchases = len(purchase_data)

print('Total Purchases: ', tot_purchases)

Total Purchases:  780

In [7]:
# Print total revenue, format to include dollar sign and round to two decimals
tot_rev = '${:.2f}'.format(purchase_data['Price'].sum())

print('Total Revenue: ', tot_rev)

Total Revenue:  $2379.77

In [8]:
# Create/display summary data frame
pur_analysis_df = pd.DataFrame(
                        {'Total Players' : [tot_players],
                        'Unique Items' : [unique_items],
                        'Average Price' : [avg_price],
                        'Total Purchases' : [tot_purchases],
                        'Total Revenue' : [tot_rev]
                        }
                                )

pur_analysis_df

   Total Players  Unique Items Average Price  Total Purchases Total Revenue
0            576           179         $3.05              780      $2379.77

# GENDER DEMOGRAPHICS

In [9]:
# Drop duplicates in SN column to get total unique users
pur_data_no_dups = purchase_data.drop_duplicates('SN')

## Male

In [10]:
# Male player count
male_count = pur_data_no_dups['Gender'].value_counts().Male

male_count

484

In [11]:
# Male player proportion
male_prop = pur_data_no_dups['Gender'].value_counts(normalize = True).Male

# Male player percentage
male_pct = '{:.2f}%'.format(male_prop * 100)

male_pct

'84.03%'

## Female

In [12]:
# Female player count
female_count = pur_data_no_dups['Gender'].value_counts().Female

female_count

81

In [13]:
# Female player proportion
female_prop = pur_data_no_dups['Gender'].value_counts(normalize = True).Female

# Female player percentage
female_pct = '{:.2f}%'.format(female_prop * 100)

female_pct

'14.06%'

## Other/Non-Disclosed

In [14]:
# Other/non-disclosed player count
other_count = tot_players - male_count - female_count

other_count

11

In [15]:
# Other/non-disclosed player proportion
other_prop = other_count / tot_players

# Other/non-disclosed player percentage
other_pct = '{:.2f}%'.format(other_prop * 100)

other_pct

'1.91%'

## Summary Data Frame

In [16]:
# Create/display gender demographics data frame
gender_demo_df = pd.DataFrame(
                        {'Total Count' : [male_count, female_count, other_count],
                        'Percentage' : [male_pct, female_pct, other_pct]
                        },
                        index = ['Male', 'Female', 'Other / Non-Disclosed']
                                )

gender_demo_df

                       Total Count Percentage
Male                           484     84.03%
Female                          81     14.06%
Other / Non-Disclosed           11      1.91%

# PURCHASING ANALYSIS (GENDER)

## Filter Dataset by Gender

In [17]:
# Filter dataset by male purchases
male_pur_df = purchase_data.loc[purchase_data['Gender'] == 'Male', :]

male_pur_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [18]:
# Filter dataset by female purchases
female_pur_df = purchase_data.loc[purchase_data['Gender'] == 'Female', :]

female_pur_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [19]:
# Filter dataset by other/non-disclosed purchases
other_pur_df = purchase_data.loc[purchase_data['Gender'] == 'Other / Non-Disclosed', :]

other_pur_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

## GroupBy Gender

In [20]:
# Using GroupBy in order to separate the data into fields based on "Gender" values
grouped_pur_gender = purchase_data.groupby(['Gender'])

## Purchase Count by Gender

In [21]:
# Purchase count by gender
gender_count = grouped_pur_gender['Purchase ID'].count()
gender_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

## Average Purchase Price by Gender

In [22]:
# Average purchase price by gender
avg_price = grouped_pur_gender['Price'].mean()
avg_price_neat = avg_price.round(decimals=2)
avg_price_neat

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

## Total purchase value by gender

In [23]:
# Total purchase value by gender
tot_value = grouped_pur_gender['Price'].sum()
tot_value_neat = tot_value.round(decimals=2)
tot_value_neat

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

## Average total purchase per person by gender

### Male

In [24]:
# Average total purchase per person by gender
# Male
# Using GroupBy in order to separate the data into fields based on "SN" values
grouped_SN_male = male_pur_df.groupby(['SN'])

male_sum = grouped_SN_male['Price'].sum()

male_mean = male_sum.mean()

male_mean_neat = '{:.2f}'.format(male_mean)

male_mean_neat

'4.07'

### Female

In [25]:
# Average total purchase per person by gender
# Female
# Using GroupBy in order to separate the data into fields based on "SN" values
grouped_SN_female = female_pur_df.groupby(['SN'])

female_sum = grouped_SN_female['Price'].sum()

female_mean = female_sum.mean()

female_mean_neat = '{:.2f}'.format(female_mean)

female_mean_neat

'4.47'

### Other/Non-Disclosed

In [26]:
# Average total purchase per person by gender
# Other/Non-disclosed
# Using GroupBy in order to separate the data into fields based on "SN" values
grouped_SN_other = other_pur_df.groupby(['SN'])

other_sum = grouped_SN_other['Price'].sum()

other_mean = other_sum.mean()

other_mean_neat = '{:.2f}'.format(other_mean)

other_mean_neat

'4.56'

## Summary Data Frame

In [27]:
# Create/display gender purchase analysis data frame
gender_analysis_df = pd.DataFrame(
                        {'Purchase Count' : [gender_count['Female'], gender_count['Male'], gender_count['Other / Non-Disclosed']],
                        'Average Purchase Price ($)' : [avg_price_neat['Female'], avg_price_neat['Male'], avg_price_neat['Other / Non-Disclosed']],
                        'Total Purchase Value ($)' : [tot_value_neat['Female'], tot_value_neat['Male'], tot_value_neat['Other / Non-Disclosed']],
                        'Avg Total Purchase per Person ($)' : [female_mean_neat, male_mean_neat, other_mean_neat]
                        },
                        index = ['Female', 'Male', 'Other / Non-Disclosed']
                                )

gender_analysis_df

,Purchase Count,Average Purchase Price ($),Total Purchase Value ($),Avg Total Purchase per Person ($)
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

# AGE DEMOGRAPHICS

In [28]:
# Find max age to set max age bin
purchase_data['Age'].max()

45

In [29]:
# Create bins for age ranges
# Bins are 0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50]

# Create names for eight bins
age_ranges = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [30]:
# Slice the data and place it into bins
pd.cut(purchase_data['Age'], age_bins, labels=age_ranges).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [31]:
# Place the data series into a new column inside of the DataFrame
purchase_data['Age Demo'] = pd.cut(purchase_data['Age'], age_bins, labels=age_ranges)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Demo
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

## Summary Data Frame

In [32]:
# Create a GroupBy object based upon "Age Demo"
age_group = purchase_data.groupby('Age Demo')

# Find how many rows (by SN to identify unique users) fall into each bin
users_by_age = pd.DataFrame(age_group['SN'].nunique())

users_by_age

           SN
Age Demo
<10        17
10-14      22
15-19     107
20-24     258
25-29      77
30-34      52
35-39      31
40+        12

In [33]:
# Add "Percentage of Players" column to data frame
users_by_age['Percentage of Players'] = users_by_age['SN'] / tot_players

users_by_age

           SN  Percentage of Players
Age Demo
<10        17               0.029514
10-14      22               0.038194
15-19     107               0.185764
20-24     258               0.447917
25-29      77               0.133681
30-34      52               0.090278
35-39      31               0.053819
40+        12               0.020833

In [34]:
# Rename "SN" column to "Total Count"
users_by_age2 = users_by_age.rename(columns = {'SN':'Total Count'})

users_by_age2

          Total Count  Percentage of Players
Age Demo
<10                17               0.029514
10-14              22               0.038194
15-19             107               0.185764
20-24             258               0.447917
25-29              77               0.133681
30-34              52               0.090278
35-39              31               0.053819
40+                12               0.020833

### Final Data Frame

In [35]:
# Format "Percentage of Players" from decimal to percentage
users_by_age_final = users_by_age2.style.format({'Percentage of Players': '{:.2%}'})

In [36]:
# Display final summary table
users_by_age_final

# PURCHASING ANALYSIS (AGE)

In [37]:
# Find how many purchases fall into each age demo bin (bins created in previous section)
pur_by_age = pd.DataFrame(age_group['SN'].count())

pur_by_age

           SN
Age Demo
<10        23
10-14      28
15-19     136
20-24     365
25-29     101
30-34      73
35-39      41
40+        13

In [38]:
# Rename "SN" column to "Purchase Count"
pur_by_age2 = pur_by_age.rename(columns = {'SN':'Purchase Count'})

pur_by_age2

          Purchase Count
Age Demo
<10                   23
10-14                 28
15-19                136
20-24                365
25-29                101
30-34                 73
35-39                 41
40+                   13

In [47]:
# Calculate average purchase price per age demo
pur_by_age2['Average Purchase Price'] = age_group['Price'].mean()

# Calculate total purchase value per age demo
pur_by_age2['Total Purchase Value'] = age_group['Price'].sum()

# Calculate avg total purchase per person per age demo (dividing by unique users per demo identified in users_by_age table)
pur_by_age2['Avg Total Purchase per Person'] = pur_by_age2['Total Purchase Value']/ users_by_age['SN']

pur_by_age2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Demo,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

## Final Summary Data Frame

In [49]:
# Format purchase columns to two decimal places with dollar sign
pur_by_age_final = pur_by_age2.style.format({'Average Purchase Price':'${0:,.2f}', 
                                             'Total Purchase Value':'${0:,.2f}', 
                                             'Avg Total Purchase per Person':'${0:,.2f}',})

pur_by_age_final

# TOP SPENDERS

In [52]:
# Create a GroupBy object based upon "SN"
sn_group = purchase_data.groupby(['SN'])

# Find how many rows (to identify number of purchases) fall into each bin
pur_by_sn = pd.DataFrame(sn_group['SN'].count())

pur_by_sn

               SN
SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
...            ..
Yathecal82      3
Yathedeu43      2
Yoishirrala98   1
Zhisrisu83      2
Zontibe81       3

[576 rows x 1 columns]

In [53]:
# Rename 2nd "SN" column to "Purchase Count"
pur_by_sn2 = pur_by_sn.rename(columns = {'SN':'SN', 'SN':'Purchase Count'})

pur_by_sn2

               Purchase Count
SN
Adairialis76                1
Adastirin33                 1
Aeda94                      1
Aela59                      1
Aelaria33                   1
...                       ...
Yathecal82                  3
Yathedeu43                  2
Yoishirrala98               1
Zhisrisu83                  2
Zontibe81                   3

[576 rows x 1 columns]

In [54]:
# Calculate average purchase price per user
pur_by_sn2['Average Purchase Price'] = sn_group['Price'].mean()

# Calculate total purchase value per user
pur_by_sn2['Total Purchase Value'] = sn_group['Price'].sum()

pur_by_sn2

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [61]:
# List top five spenders by highest purchase value
# Sort table by "Total Purchase Value" (descending order)
pur_by_sn_sorted = pur_by_sn2.sort_values('Total Purchase Value', ascending=False)

top_spenders = pur_by_sn_sorted.head(5)

top_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Final Data Frame

In [62]:
# Format purchase columns to two decimal places with dollar sign
top_spenders_neat = top_spenders.style.format({'Average Purchase Price':'${0:,.2f}', 
                                             'Total Purchase Value':'${0:,.2f}'
                                     })

In [63]:
# Display final summary data frame of top five spenders
top_spenders_neat

# MOST POPULAR ITEMS

In [93]:
# Drop all non-item columns and save to new data frame

item_data = purchase_data.drop(columns = ['Purchase ID', 'SN', 'Age', 'Gender', 'Age Demo'])

item_data2 = item_data.sort_values('Item ID')

item_data2

     Item ID            Item Name  Price
204        0             Splinter   1.28
133        0             Splinter   1.28
150        0             Splinter   1.28
662        0             Splinter   1.28
121        1             Crucifer   3.26
..       ...                  ...    ...
758      182            Toothpick   4.03
256      182            Toothpick   4.03
705      183  Dragon's Greatsword   1.09
618      183  Dragon's Greatsword   1.09
165      183  Dragon's Greatsword   1.09

[780 rows x 3 columns]

In [104]:
# Create a GroupBy object based upon "Item ID" and "Item Name"
item_group = item_data2.groupby(['Item ID', 'Item Name'])

# Find how many unique items (by "Item ID")
item_count = pd.DataFrame(item_group.nunique())

item_count

                                                      Price
Item ID Item Name
0       Splinter                                          1
1       Crucifer                                          2
2       Verdict                                           1
3       Phantomlight                                      1
4       Bloodlord's Fetish                                1
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm      1
179     Wolf, Promise of the Moonwalker                   1
181     Reaper's Toll                                     1
182     Toothpick                                         1
183     Dragon's Greatsword                               1

[179 rows x 1 columns]

# MOST PROFITABLE ITEMS